#### ElectricalLoadAreaData Members

---

|  |
| --- |
| ElectricalLoadAreaData Class   Methods   Properties   See Also |

The  ElectricalLoadAreaData  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CreateElectricalLoadAreas | Creates electrical load areas on all the empty plan circuits of the given level. |
| Public method | Dispose | (Inherited from  SpatialElementDomainData  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetAreaBasedLoadIds | Gets the area based load ids of the electrical load area to be included. |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method Static member | HasCircuitsWithoutElectricalLoadAreas | Checks whether there are any empty plan circuits in which there are no electrical load areas. |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  SpatialElementDomainData  .) |

# See Also

ElectricalLoadAreaData Class

Autodesk.Revit.DB.Electrical Namespace